#! /usr/bin/env python
# -*- coding: utf-8 -*-

# target_string: '\cellcolor[rgb]{0.74,0.90,0.70}{}&\cellcolor[rgb]{.7,.9,.9}4&\cellcolor[rgb]{.8,.8,.9}5&\cellcolor[rgb]{.8,.8,.9}5\\'


color = ['FUCK', [188., 255., 255.], [222., 242., 217.], [255., 255., 255.], [254., 228., 211.], [253., 201., 168.]]

t3_1_global_color = [1,5,2,3,1,1,1,1,1,1,1,1,1,1,1,4]
t3_1_north_color = [2,2,5,1,3,1,1,1,4,1,5,1,1,1,1,2]
t3_1_global_location = ["非洲以南的海上","斯里兰卡以西的海上","印度洋中心","印度洋中心","中东地区里海北侧","巴基斯坦北侧的乡下","西藏自治区日喀则地区聂拉木县","印度东侧曼尼普尔近锡尔杰尔","印度洋北侧","印度洋北侧","新疆维吾尔自治区阿克苏地区沙雅县","青海省海西蒙古族藏族自治州格尔木市","非洲南侧","非洲东南侧","印度洋中心","印度洋中心"]
t3_1_north_location = ["孟买西侧阿拉伯海域", "马尔代夫西北方向阿拉伯海域", "斯里兰卡东南方向印度洋海域", "印度尼西亚棉兰", "舍甫琴柯堡西侧里海海域", "阿富汗中部地区", "西藏自治区日喀则地区吉隆县", "西藏自治区那曲地区那曲县", "马哈奇卡拉东侧里海海域", "塔吉克斯坦西南角", "新疆维吾尔自治区阿克苏地区沙雅县", "青海省海西蒙古族藏族自治州", "阿曼东侧阿拉伯海海域", "印度索姆纳特东侧", "印度金奈东侧阿拉伯海海域", "孟加拉湾安达曼群岛西侧"]

t3_2_global_color = [3, 2, 3, 1, 1, 1, 2, 1, 2, 2, 2, 1, 1, 1, 2, 1, 2, 2, 1, 1]
t3_2_north_color = [1, 1, 1, 4, 1, 1, 1, 1, 1, 1, 1, 4, 1, 1, 4, 1, 3, 1, 1, 5]
t3_2_global_location = ["南极洲海岸边", "南极洲海岸边", "广西壮族自治区梧州市藤县321国道", "澳大利亚与大洋洲的中点", "印度洋南侧", "澳大利亚与大洋洲的中点", "俄罗斯外贝加尔边疆区", "澳大利亚西南侧", "澳大利亚西侧", "蒙古曼达勒敖包", "澳大利亚西南侧", "俄罗斯萨哈共和国", "澳大利亚西侧", "俄罗斯西伯利亚平原南侧", "俄罗斯与蒙古的国境线附近", "非洲南侧", "印度洋中心", "印度洋中心", "印度洋中心", "印度洋中心"]
t3_2_north_location = ["蒙古巴彦德勒格尔", "湖南省益阳市桃江县", "湖南省永州市零陵区", "柬埔寨东北侧", "越南陆地最南端", "北冰洋中心", "俄罗斯西伯利亚平原中心", "蒙古共和国北侧", "蒙古共和国南侧", "内蒙古自治区阿拉善盟阿拉善左旗", "北冰洋中心", "俄罗斯西伯利亚平原北岸", "俄罗斯西伯利亚平原中部", "蒙古共和国与俄罗斯国境线北侧", "蒙古共和国与俄罗斯国境线北侧", "蒙古共和国乌兰巴托", "内蒙古自治区巴彦淖尔市乌拉特中旗呼四线", "内蒙古自治区鄂尔多斯市鄂托克前旗上海街", "云南省楚雄彝族自治州禄丰县", "云南省临沧市云县漫湾镇嘎止村"]

starter = '\cellcolor[rgb]{.9,.9,.9}$%d\sim%d$ &'
cell = '\cellcolor[rgb]{%.2f,%.2f,%.2f}{%s}'
ender = '\\\\\n'

out = open('latex.txt', 'w')

def cell_filler(c, s):
	return cell % (color[c][0]/255, color[c][1]/255, color[c][2]/255, s)

for Lg_min in xrange(5):
	out.write(starter % (Lg_min*1.5, (Lg_min+1)*1.5,))
	for i in xrange(4):
		out.write(cell_filler(t3_2_north_color[i*4 + Lg_min], t3_2_north_location[i*4 + Lg_min]))
		if i != 3:
			out.write('&')
	out.write(ender)
